Examinator/src/Catalogs/КаталогМероприятийСУО/КаталогМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогМероприятийСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАудитории</name>
    <type>
      <types>CatalogRef.ТипыАудиторийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольПреподавателя</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождениеЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПовторноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Темы</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.СодержаниеМероприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПриПроведении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПреподаватели</name>
    <attributes>
      <name>РольПреподавателя</name>
      <type>
        <types>CatalogRef.РолиПреподавателейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотрВедомости</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/МестаПроведенияМероприятийСУО/МестаПроведенияМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МестаПроведенияМероприятийСУО</name>
  <enumValues>
    <name>Аудитория</name>
  </enumValues>
  <enumValues>
    <name>Дистанционно</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/КаталогМероприятийСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Вид.ТребуетсяПреподаватель Тогда
		
		Если ЗначениеЗаполнено(РольПреподавателя) Тогда
			
			НайденныйОсновнойПреподавательВДополнительных = ДополнительныеПреподаватели.Найти(РольПреподавателя, "РольПреподавателя");
			
			Если НайденныйОсновнойПреподавательВДополнительных <> Неопределено Тогда
				
				Текст = НСтр("ru = 'Дополнительный преподаватель не может иметь роль основного преподавателя'");
				Поле = "ДополнительныеПреподаватели";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле + "[" + Строка(НайденныйОсновнойПреподавательВДополнительных.НомерСтроки - 1) + "].РольПреподавателя", , Отказ);
				
			КонецЕсли;
			
			Если ОбщегоНазначенияСУКлиентСервер.ЕстьСовпаденияВКоллекцииЗначений(ДополнительныеПреподаватели, "РольПреподавателя") Тогда
				
				Текст = НСтр("ru = 'Роли дополнительных преподавателей должны быть уникальными'");
				Поле = "ДополнительныеПреподаватели";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		Иначе
			
			Текст = НСтр("ru = 'Заполните поле ""Роль преподавателя""'");
			Поле = "РольПреподавателя";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Вид.Общее Тогда
		
		Если НЕ ЗначениеЗаполнено(МестоПроведения) Тогда
		
			Текст = НСтр("ru = 'Заполните поле ""Место проведения""'");
			Поле = "МестоПроведения";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
		КонецЕсли;
		
		Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда
			
			Если НЕ ЗначениеЗаполнено(ТипАудитории) Тогда
			
				Текст = НСтр("ru = 'Укажите тип аудитории'");
				Поле = "ТипАудитории";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ПродолжительностьВСекундах) Тогда
			
				Текст = НСтр("ru = 'Укажите продолжительность мероприятия'");
				Поле = "Продолжительность";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Вид.ВыставляетсяОценка
		И НЕ ЗначениеЗаполнено(ШкалаОценки) Тогда
		
		Текст = НСтр("ru = 'Заполните поле ""Шкала оценки""'");
		Поле = "ШкалаОценки";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, ЭтотОбъект, Поле,, Отказ);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка
		ИЛИ ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Вид.Общее Тогда
		МестоПроведения = Неопределено;
	КонецЕсли;
	
	Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Дистанционно Тогда
		ТипАудитории = Справочники.ТипыАудиторийСУО.ПустаяСсылка();
	КонецЕсли;
	
	Если МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория Тогда		
		АдресВИнтернете = "";		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
